
export let Agreement = {
    "0": {
        "text": "用户协议",
        "style": {
            "align": "CENTER",
            "bold": true
        }
    },
    "1": {
        "text": "重要须知：",
        "style": {
            "bold": true
        }
    },
    "2": {
        "text": "《<app_name>许可及服务协议》（以下简称“本协议”）是由您与company(以下称”本公司“)就《app_name》产品及其服务所订立的民事合同。如果您使用《app_name》，或通过其他方式获取和使用《app_name》，请务必审慎阅读、充分理解本协议全部条款及相关内容，特别是免除或者限制本公司责任的条款（以下称“免责条款”）、对用户权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款。前述免责、限制及争议解决方式和管辖等条款可能以黑体加粗、下划线、颜色标记或其他合理方式提示您注意，您对该等条款的确认将可能导致您在特定情况下的被动、不便、损失，请您在确认同意本协议之前或在使用《app_name》之前再次详细阅读前述免责、限制及争议解决方式和管辖等条款。"
    },
    "3": {
        "text": "如您没有阅读或不同意本协议所有条款，您将无权使用《app_name》软件或相关服务。如您点击同意、接受本协议或下一步，或您注册、使用《app_name》软件或相关服务，均视为您已阅读并同意签署本协议，此后您不得以未阅读/未同意本协议内容或类似理由提出任何形式的抗辩。\n\n\t\t\t\t如您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。\n\n",
        "style": {
            "bold": true
        }
    },
    "4": {
        "text": [
            "1【定义】\n",
            "\t\t\t\t1.1 本协议：指本协议正文、《用户隐私政策条款》、游戏规则及上述条款与规则的修订版本。符合上述范围的内容一经正式发布，即为本协议不可分割的组成部分。\n",
            "\t\t\t\t1.2 游戏规则：指《app_name》在游戏内或相关官方网站，不时发布并修订的关于《app_name》的用户守则、玩家条例、游戏公告、提示及通知等内容。\n",
            "\t\t\t\t1.3 《app_name》：指由本公司研发/提供/运营的《app_name》网络游戏的统称，包括计算机客户端游戏、网页游戏、HTML5游戏（H5游戏）、移动终端游戏（包括但不限于IOS端和Android端），以及其他形式的游戏；《app_name》可能以软件形式提供，这种情况下，《app_name》还包括该相关软件及相关文档。\n",
            "\t\t\t\t1.4 您：又称“玩家”或“用户”，指被授权使用《app_name》及其服务的自然人。\n",
            "\t\t\t\t1.5 游戏数据：指您在使用《app_name》过程中产生的被服务器记录的各种数据，包括但不限于角色数据、虚拟物品数据、行为日志、购买日志等等数据。\n\n"
        ]
    },
    "5": {
        "text": [
            "2【游戏账号】\n",
            "\t\t\t\t2.1 您承诺以您本人的真实身份实名注册或认证《app_name》的游戏账号，并保证所提供的个人身份资料信息真实、准确、完整、有效，依据有关法律法规对所提供的信息承担相应的法律责任。您以本人的真实身份实名注册或认证后，如需要修改所提供的个人身份资料信息的，本公司应当及时、有效地为您提供该项服务。\n",
            "\t\t\t\t2.2 如您以他人身份资料进行实名注册或认证的，本公司有权采取本协议第6.6条规定的一种或多种处理措施，并可公布处理结果，因此造成的一切后果由您自行承担，且本公司有权要求您赔偿因此给本公司造成的所有损失。\n",
            "\t\t\t\t2.3 如您使用经本公司认可的第三方账号作为游戏账号和享受游戏的，您同意本公司可向该第三方账号的提供方核实该第三方账号的实名认证情况。如该第三方账号的提供方反馈您使用的第三方账号已完成实名认证的，则您无需再进行实名注册，您在此也同意该第三方账号的提供方可以向本公司提供您的实名认证状态与您的年龄情况（用于判断是否需要纳入防沉迷系统之中）。如该第三方账号的提供方反馈您使用的第三方账号未完成实名认证的，或本公司未向该第三方账号的提供方核实该第三方账号的实名认证情况的，则您应当按照本公司的要求进行实名注册，您同意本公司可将您提交的实名信息提交给合法留存您信息的国家有权机关、金融机构、支付机构和有关组织对您提交的实名信息进行核验。\n",
            "\t\t\t\t2.4 您进一步知悉并同意，您在游客模式下（如有）可能无法进行游戏充值或消费。且一旦您卸载或重装《app_name》，或您更换手机、电脑等终端设备或该等终端设备损坏的，您在该游客模式下所有游戏相关数据可能都将会被清空，且无法查询和恢复。如因此造成您任何损失的，均由您自行承担。\n",
            "\t\t\t\t2.5 如您使用经认可的第三方账号作为游戏账号和享受游戏的，您还应遵守有关该第三方账号的协议、规则，且因该第三方账号产生的相关问题包括但不限于被盗等，您应自行联系该第三方进行解决，本公司可提供相应的协助。\n",
            "\t\t\t\t2.6 您充分理解并同意，本公司有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给用户和他人的民事权利造成损害的，应当承担由此产生的法律责任。\n",
            "\t\t\t\t2.7 如您因他人冒用、盗用您的游戏账号及密码、或任何其他未经您合法授权使用等原因要求本公司采取一定的措施，本公司有权要求您提供与注册信息一致有效的个人身份信息以便核实。如因此产生相应的风险或损失的，由您自行承担。\n",
            "\t\t\t\t2.8 您理解并同意，您不得将游戏账号以任何方式提供给他人使用，包括但不限于不得以转让、出租、借用等方式提供给他人作包括但不限于直播、录制、代打、代练等商业性使用。否则，因此产生任何法律风险及其他风险均由您自行承担。\n\n"
        ]
    },
    "6": {
        "text": [
            "3【用户信息收集、使用及保护】\n",
            "\t\t\t\t3.1 您同意并授权本公司为履行本协议之目的收集您的用户信息，这些信息包括您在实名注册系统中注册或认证的信息、您游戏账号下的游戏数据以及其他您在使用游戏服务的过程中向本公司提供或本公司基于安全、用户体验优化等考虑而需收集的信息，本公司对您的用户信息的收集将遵循本协议及相关法律的规定。\n",
            "\t\t\t\t3.2 您充分理解并同意：本公司或其合作的第三方可以根据您的用户信息，通过短信、电话、邮件等各种方式向您提供关于《app_name》的活动信息、推广信息等各类信息。\n",
            "\t\t\t\t3.3 您理解并同意：为了更好地向您提供游戏服务，改善游戏体验，本公司可对您作为游戏账号的QQ号码、微信账号以及经认可的其他账号（包括该等账号中的昵称、头像，以及好友关系）以及在《app_name》中的相关操作信息、游戏信息等信息（以下称“该等信息”。该等信息具体包括但不限于您的登录状态、对战信息/状态、成就信息等）进行收集、使用，并可向您本人或其他用户或好友展示。\n",
            "\t\t\t\t3.4 您应对通过《app_name》及相关服务了解、接收或可接触到的包括但不限于其他用户在内的任何人的个人信息予以充分尊重，您不应以搜集、复制、存储、传播或以其他任何方式使用其他用户的个人信息，否则，由此产生的后果由您自行承担。\n",
            "\t\t\t\t3.5 保护用户信息及隐私是本公司的一项基本原则。除本协议另有规定外，游戏服务对用户信息收集、使用及保护等将遵循《用户隐私政策》等协议规定。除法律另有规定外，如您已同意或授权本公司依据前述协议或规定收集、使用或处理涉及您的个人信息的，在您撤回该同意或授权后，不影响本公司在此之前已基于您的同意或授权所进行的个人信息的收集、使用或处理，本公司对此前相关个人信息收集、使用或处理继续有效。\n\n"
        ]
    },
    "7": {
        "text": [
            "4【游戏服务】\n",
            "\t\t\t\t4.1 在您遵守本协议及相关法律法规的前提下，本公司给予您一项个人的、不可转让及非排他性的许可，以使用游戏服务。您仅可为非商业目的使用游戏服务，包括：\n",
            "\t\t\t\t\t\t4.1.1 接收、下载、安装、启动、升级、登录、显示、运行和/或截屏《app_name》；\n",
            "\t\t\t\t\t\t4.1.2 创建游戏角色，设置网名，查阅游戏规则、用户个人资料，在游戏中购买、使用游戏道具、游戏装备、游戏币等，使用聊天功能、社交分享功能；\n",
            "\t\t\t\t\t\t4.1.3 使用《app_name》支持并允许的其他某一项或几项功能。\n"
        ]
    },
    "8": {
        "text": [
            "\t\t\t\t4.2 您在使用《app_name》及游戏服务时，还应遵守本协议第五条关于软件许可的规定。\n",
            "\t\t\t\t4.3 本条及本协议其他条款未明示授权的其他一切权利仍由本公司保留，您在行使这些权利时须另外取得本公司的书面许可。\n",
            "\t\t\t\t4.4 如果您违反本协议任何约定的，本公司有权采取本协议中第6.6条规定的一种或多种处理措施，并可公布处理结果，且有权要求您赔偿因您的违约行为而给本公司造成的所有损失。\n",
            "\t\t\t\t4.5 您充分理解并同意，本公司有权自行对违反有关法律法规或本协议规定的行为进行处理，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。\n",
            "\t\t\t\t4.6 您充分理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；本公司因此遭受损失的，您也应当一并赔偿。\n",
            "\t\t\t\t4.7 您充分理解并同意：游戏装备、游戏币及其他游戏道具等是游戏服务的一部分，本公司在此许可您依本协议而获得其使用权。您购买、使用游戏装备、游戏币及其他游戏道具等应遵循本协议、游戏具体规则的要求；同时，游戏装备、游戏币及其他游戏道具等可能受到一定有效期限的限制，如果您在规定的有效期内未使用，除不可抗力或可归责于本公司的原因外，一旦有效期届满，将会自动失效。\n"
        ]
    },
    "9": {
        "text": [
            "\t\t\t\t4.8 您充分理解并同意：为更好地向您提供游戏服务，本公司有权对游戏中的任何内容或构成元素等作出调整、更新或优化（包括但不限于您购买或正在使用的角色、游戏装备及其他游戏道具的美术设计、性能及相关数值设置等作出调整、更新或优化等）。且如本公司做出相应调整、更新或优化的，您同意不会因此追究本公司的任何法律责任。\n",
            "\t\t\t\t4.9 您充分理解并同意：为保障您游戏账号安全，为营造公平、健康及安全的游戏环境，在您使用游戏服务的过程中，在不违反相关法律规定情况下，本公司可以通过技术手段了解您终端设备的随机存储内存以及与《app_name》同时运行的相关程序。一经发现有任何未经授权的、危害游戏服务正常运营的相关程序，本公司可以收集所有与此有关的信息并采取合理措施予以打击。\n",
            "\t\t\t\t4.10 您充分理解并同意：为了保证您及其他用户的游戏体验，本公司有权转移或者清除游戏服务器上存储的一些过往的游戏数据。\n",
            "\t\t\t\t4.11 公司有权按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用游戏服务过程中的合法权益，包括可能采取技术措施、禁止未成年人接触不适宜的游戏或者游戏功能、限制未成年人的游戏时间、预防未成年人沉迷网络。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照执行相关指引、内容说明或警示；其他玩家在使用游戏服务的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康游戏环境。\n",
            "\t\t\t\t4.12 您知悉并同意，出现以下情形之一的，本公司有权将您的游戏账号纳入相应的防沉迷系统，采取相应的防沉迷措施：\n"
        ]
    },
    "10": {
        "text": [
            "\t\t\t\t\t\t4.12.1 系统判断您未满18周岁的；或\n",
            "\t\t\t\t\t\t4.12.2 您提交的实名身份信息不规范的；或\n",
            "\t\t\t\t\t\t4.12.3 您实名验证未通过的；或\n",
            "\t\t\t\t\t\t4.12.4 游客模式登录的；或\n",
            "\t\t\t\t\t\t4.12.5 其他国家法律法规政策要求或本公司有合理理由认为需要纳入防沉迷系统的情形的。\n",
            "\t\t\t\t4.13 对纳入相应防沉迷系统的游戏账号，我们有权依据国家有关法律法规及政策规定、本协议其他条款规定、《app_name》运营策略或根据您法定监护人的合理要求采取以下一种或多种措施：\n",
            "\t\t\t\t\t\t4.13.1 将与您游戏相关的信息（包括但不限于您游戏账号的登录信息、充值流水信息等）提供给您的法定监护人，使得您的法定监护人可及时或同步了解您的游戏情况；\n",
            "\t\t\t\t\t\t4.13.2 限制您的游戏账号的消费额度；\n",
            "\t\t\t\t\t\t4.13.3 采取技术措施屏蔽某些游戏或游戏的某些功能，限定您的游戏时间或游戏时长；\n",
            "\t\t\t\t\t\t4.13.4 注销或删除您的游戏账号及游戏数据等相关信息；\n",
            "\t\t\t\t\t\t4.13.5 您的法定监护人要求采取的，或本公司认为可采取的其他合理措施，以限制或禁止用户您使用《app_name》；\n",
            "\t\t\t\t\t\t4.13.6 国家法律法规或政策要求的相关措施。\n"
        ]
    },
    // "11": {
    //     "text": [
    //         "\t\t\t\t4.14 本公司向您提供游戏服务本身属于商业行为，您有权自主决定是否根据本公司自行确定的收费项目（包括但不限于购买游戏内的虚拟道具的使用权以及接受其他增值服务等各类收费项目）及收费标准支付相应的费用，以获得相应的游戏服务。如您不按相应标准支付相应费用的，您将无法获得相应的游戏服务。\n",
    //         "\t\t\t\t4.15 您知悉并同意：收费项目或收费标准的改变、调整是一种正常的商业行为，您不得因为收费项目或收费标准的改变、调整而要求本公司进行赔偿或补偿。您使用人民币进行游戏充值购买或兑换游戏虚拟货币、虚拟道具及其他虚拟物品或增值服务的，视为您购买了游戏服务，您所购买或兑换的游戏虚拟货币、虚拟道具及其他虚拟物品或增值服务将不能退还或兑换成法定货币，但法律另有强制性规定的除外。\n",
    //         "\t\t\t\t4.16 在任何情况下，本公司不对因不可抗力导致的您在使用游戏服务过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家法律、法规、政策及国家机关的命令及其他政府行为或者其它的诸如地震、水灾、雪灾、火灾、海啸、台风、罢工、战争等不可预测、不可避免且不可克服的事件。\n"
    //     ]
    // },
    // "12": {
    //     "text": [
    //         "\t\t\t\t4.17 《app_name》可能因游戏软件BUG、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的游戏角色、游戏道具、游戏装备及游戏币等账号数据或游戏数据发生异常。在数据异常的原因未得到查明前，本公司有权暂时冻结该游戏账号；若查明数据异常为非正常游戏行为所致，本公司有权恢复游戏账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），而无须向您承担任何责任。若数据异常是由于您实施违法违规行为或违反本协议约定的行为所致，本公司有权采取本协议第6.6条规定的一种或多种处理措施。\n",
    //         "\t\t\t\t4.18 本公司未授权您从任何第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币及其他游戏服务。本公司不对第三方交易行为（第三方交易，是指您从第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币及其他游戏服务的行为）负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。\n",
    //         "\t\t\t\t4.19 您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非本公司造成，由此可能导致您在某一操作系统中的充值和游戏数据不能顺利转移到另一操作系统中。由于您在不同系统进行切换造成的充值损失和游戏数据丢失风险应由您自行承担，本公司对此不承担任何责任。\n",
    //         "\t\t\t\t4.20 您充分理解到：《app_name》中可能会设置强制对战区域或玩法，如果您不同意强制对战，请您不要进入该游戏或游戏区域；您的进入，将被视为同意该玩法并接受相应后果。\n",
    //         "\t\t\t\t4.21 本公司自行决定终止运营《app_name》时或《app_name》因其他任何原因终止运营时，本公司会按照国家有关网络游戏终止运营的相关法律法规规定处理游戏终止运营相关事宜，以保障用户合法权益。\n"
    //     ]
    // },
    // "13": {
    //     "text": [
    //         "5【软件许可】\n",
    //         "\t\t\t\t5.1 使用游戏服务可能需要下载并安装相关软件，您可以直接从本公司的相关网站上获取该软件，也可以从得到本公司授权的第三方获取。如果您从未经本公司逃出丛林授权的第三方获取《app_name》或与《app_name》名称相同的游戏，将视为您未获得本公司授权，本公司无法保证该游戏能够正常使用，并对因此给您造成的损失不予负责。\n",
    //         "\t\t\t\t5.2 本公司可能为不同的终端设备或操作系统开发了不同的软件版本，包括但不限于windows、ios、android、windows phone、symbian、blackberry、Nintendo Switch等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。\n",
    //         "\t\t\t\t5.3 若《app_name》以软件形式提供，本公司给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的在单一台终端设备上下载、安装、登录、使用该《app_name》。\n",
    //         "\t\t\t\t5.4 为提供更加优质、安全的服务，在软件安装时本公司可能推荐您安装其他软件，您可以选择安装或不安装。\n",
    //         "\t\t\t\t5.5 如果您不再需要使用该软件或者需要安装新版，可以自行卸载。如果您愿意帮助本公司改进产品服务，请告知卸载的原因。\n",
    //         "\t\t\t\t5.6 为了保证游戏服务的安全性和功能的一致性，本公司有权对软件进行更新，或者对软件的部分功能效果进行改变或限制。\n",
    //         "\t\t\t\t5.7 软件新版本发布后，旧版本的软件可能无法使用。本公司不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。\n\n"
    //     ]
    // },
    // "14": {
    //     "text": [
    //         "6【用户行为规范】\n",
    //         "\t\t\t\t6.1 您充分了解并同意，您必须为自己游戏账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。\n",
    //         "\t\t\t\t6.2 您除了可以按照本协议的约定使用游戏服务之外，不得进行任何侵犯《app_name》的知识产权的行为，或者进行其他的有损于本公司或其他第三方合法权益的行为。\n",
    //         "\t\t\t\t6.3 您在使用《app_name》或游戏服务时须遵守法律法规，不得利用《app_name》或游戏服务从事违法违规行为，包括但不限于：\n"
    //     ]
    // },
    // "15": {
    //     "text": [
    //         "\t\t\t\t\t\t6.3.1 违反宪法确定的基本原则的；\n",
    //         "\t\t\t\t\t\t6.3.2 危害国家统一、主权和领土完整的；\n",
    //         "\t\t\t\t\t\t6.3.3 泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；\n",
    //         "\t\t\t\t\t\t6.3.4 煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；\n",
    //         "\t\t\t\t\t\t6.3.5 宣扬邪教、迷信的；\n",
    //         "\t\t\t\t\t\t6.3.6 散布谣言，扰乱社会秩序，破坏社会稳定的；\n",
    //         "\t\t\t\t\t\t6.3.7 宣扬淫秽、色情、赌博、暴力，或者教唆犯罪的；\n",
    //         "\t\t\t\t\t\t6.3.8 侮辱、诽谤他人，侵害他人合法权益的；\n",
    //         "\t\t\t\t\t\t6.3.9 违背社会公德的；\n",
    //         "\t\t\t\t\t\t6.3.10 有法律、行政法规和国家规定禁止的其他内容的。\n"
    //     ]
    // },
    // "16": {
    //     "text": [
    //         "\t\t\t\t6.4 除非法律允许或本公司书面许可，您不得从事下列行为：\n",
    //         "\t\t\t\t\t\t6.4.1 删除游戏软件及其副本上关于著作权的信息；\n",
    //         "\t\t\t\t\t\t6.4.2 对游戏软件进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码；\n",
    //         "\t\t\t\t\t\t6.4.3 对游戏软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；\n",
    //         "\t\t\t\t\t\t6.4.4 使用第三方软件、插件、外挂、系统等；\n",
    //         "\t\t\t\t\t\t6.4.5 建立有关《app_name》的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与游戏服务完全相同或者类似的服务；\n",
    //         "\t\t\t\t\t\t6.4.6 使用、修改或遮盖《app_name》的名称、商标或其它知识产权；\n",
    //         "\t\t\t\t\t\t6.4.7 其他未经本公司明示授权或侵犯本公司权利的行为。\n"
    //     ]
    // },
    // "17": {
    //     "text": [
    //         "\t\t\t\t6.5 您在使用游戏服务过程中如有以下任何行为（以下也称“违法违规行为”）之一的，本公司有权依据本协议第6.6条及相关游戏规则的规定进行处理，并可公告处理结果：\n",
    //         "\t\t\t\t\t\t6.5.1 以某种方式暗示或伪称本公司内部员工或某种特殊身份，企图得到不正当利益或影响其他用户权益的行为；\n",
    //         "\t\t\t\t\t\t6.5.2 在《app_name》中使用、上传违法或不当词语、字符及其他内容的行为，包括用于角色命名；\n",
    //         "\t\t\t\t\t\t6.5.3 以任何方式破坏《app_name》或影响游戏服务的正常进行，包括但不限于：\n",
    //         "\t\t\t\t\t\t\t\t6.5.3.1 违规及（或）恶意注册、登录游戏的行为，包括但不限于恶意批量注册游戏账号，以及以破坏服务器鉴权、恶意挤服等方式登录游戏行为；\n",
    //         "\t\t\t\t\t\t\t\t6.5.3.2 恶意实施可能导致游戏服务器宕机、卡顿，或导致其他游戏玩家掉线、延迟等无法正常游戏的行为，如利用DDOS对游戏服务器或其他玩家进行网络流量攻击的行为等；\n",
    //         "\t\t\t\t\t\t\t\t6.5.3.3 利用游戏漏洞实施获益、破坏游戏环境或给其他玩家造成不良影响的行为；\n",
    //         "\t\t\t\t\t\t\t\t6.5.3.4 消极游戏破坏其他用户游戏体验的行为。包括但不限于恶意伤害或者击杀本方队友，恶意组队，恶意送分、降分，消极挂机、逃跑、故意送人头，以及其他消极游戏破坏用户游戏体验的行为；\n",
    //         "\t\t\t\t\t\t\t\t6.5.5.5 游戏数据表现异常，影响《app_name》公平的其他行为。\n"
    //     ]
    // },
    // "18": {
    //     "text": [
    //         "\t\t\t\t6.6 本公司有权根据您违法违规行为的情节严重程度，采取以下一种或多种措施，包括但不限于：\n",
    //         "\t\t\t\t\t\t6.6.1 警告；及/或\n",
    //         "\t\t\t\t\t\t6.6.2 禁言，包括但不限于游戏全区禁言、单区禁言以及公共频道禁言；及/或\n",
    //         "\t\t\t\t\t\t6.6.3 内容重置，包括但不限于重置或强制修改您提供或上传的非法信息或内容等；及/或\n",
    //         "\t\t\t\t\t\t6.6.4 减少或限制您的游戏收益，该游戏收益包括但不限于游戏中与游戏角色成长升级相关的所有数据（如经验值、荣誉值、声望值、称号等）的提升以及游戏中的道具、装备、虚拟货币等虚拟物品的获取；及/或\n",
    //         "\t\t\t\t\t\t6.6.5 删除或注销游戏账号、游戏数据或其他游戏相关信息；及/或\n",
    //         "\t\t\t\t\t\t6.6.6 限制或禁止您进入游戏中的特定场景或使用游戏特定功能；及/或\n",
    //         "\t\t\t\t\t\t6.6.7 强制退出游戏（即“踢出游戏”），包括但不限于强制退出整个游戏，或游戏中的单局对战，或您正在进行中的其他游戏行为；及/或\n",
    //         "\t\t\t\t\t\t6.6.8 暂时或永久性地禁止您的游戏账号登录《app_name》（以下称“封号”）；及/或\n",
    //         "\t\t\t\t\t\t6.6.9 暂时或永久性地禁止您违法违规行为涉及的特定终端（包括但不限于PC终端、移动终端等）登录《app_name》；及/或\n",
    //         "\t\t\t\t\t\t6.6.10 暂停或终止您使用《app_name》及相关服务，或单方通知您终止本协议；及/或\n",
    //         "\t\t\t\t\t\t6.6.11 就您的违法违规行为提起相应民事诉讼，追究您的侵权、违约或其他民事责任，并要求您赔偿本公司公司因您违法违规行为所受到的损失（包括本公司公司所受到的直接经济损失、名誉或商誉损失以及本公司公司对外支付的赔偿金、和解费用、律师费用、诉讼费用及其他间接损失），或移交有关行政管理机关给予行政处罚，或者移交司法机关追究您的刑事责任；及/或\n",
    //         "\t\t\t\t\t\t6.6.12 本公司通过游戏规则公布的其他处理措施。\n"
    //     ]
    // },
    // "19": {
    //     "text": [
    //         "\t\t\t\t6.7 您知悉并同意，由于外挂及游戏同步器等作弊硬件具有隐蔽性或用完后即消失等特点，本公司有权根据您的游戏数据和表现异常判断您有无使用非法外挂或游戏同步器等作弊硬件行为。\n",
    //         "\t\t\t\t6.8 您知悉并同意，如本公司依据本协议对您的游戏账号采取封号处理措施的，具体封号期间由本公司根据您违规行为情节而定。\n",
    //         "\t\t\t\t6.9 您知悉并同意：（1）在封号期间，您游戏账号中的游戏虚拟货币、游戏装备、游戏币及其他游戏道具可能都将无法使用；（2）如前述游戏虚拟货币、游戏装备、游戏币及其他游戏道具存在一定有效期，该有效期可能会在封号期间过期，您游戏账号解封后，您将无法使用该等已过期的游戏虚拟货币、游戏装备、游戏币及其他游戏道具。据此，您也同意不会因发生前述第（1）和（或）第（2）点规定的情形而追究本公司任何法律责任。\n\n"
    //     ]
    // },
    // "20": {
    //     "text": [
    //         "7【知识产权】\n",
    //         "\t\t\t\t7.1 本公司是《app_name》的知识产权权利人。《app_name》（包括但不限于《app_name》整体、游戏内所包含的所有美术、音乐、文字作品和其他游戏构成要素、组成部分，以及《app_name》运行呈现的连续动态画面）的一切著作权、商标权、专利权、商业秘密等知识产权及其他合法权益，以及与《app_name》相关的所有信息内容（包括文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，本公司享有上述知识产权和合法权益，但相关权利人依照法律规定应享有的权利除外。未经本公司事先书面同意，您不得以任何方式将《app_name》（包括但不限于《app_name》整体、游戏内所包含的所有美术、音乐、文字作品和其他游戏构成要素、组成部分，以及《app_name》运行呈现的连续动态画面）进行商业性使用或通过信息网络传播《app_name》内容。\n",
    //         "\t\t\t\t7.2 尽管本协议有其他规定，您在使用游戏服务中产生的游戏数据的所有权和知识产权归本公司所有，本公司有权保存、处置该游戏数据。其中，本公司对用户购买游戏虚拟货币的购买记录的保存期限将遵守国家法律法规有关规定。对其他游戏数据的保存期限由本公司自行决定，但国家法律法规另有规定的从其规定。\n\n"
    //     ]
    // },
    // "21": {
    //     "text": [
    //         "8【遵守当地法律监管】\n",
    //         "\t\t\t\t8.1 您在使用游戏服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。\n\n"
    //     ]
    // },
    // "22": {
    //     "text": [
    //         "9【管辖与法律适用】\n",
    //         "\t\t\t\t9.1 本协议签订地为中华人民共和国湖南省长沙市岳麓区。\n",
    //         "\t\t\t\t9.2 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。\n",
    //         "\t\t\t\t9.3 若您和本公司之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院管辖。\n",
    //         "\t\t\t\t9.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。\n",
    //         "\t\t\t\t9.5 本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。\n\n"
    //     ]
    // },
    // "23": {
    //     "text": [
    //         "10【其他】\n",
    //         "\t\t\t\t10.1 本公司有权在必要时变更本协议条款，您可以在《app_name》的相关页面查阅最新版本的协议条款。本协议条款变更后，如果您继续使用游戏服务，即视为您已接受变更后的协议。\n",
    //         "\t\t\t\t10.2 本公司提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防受骗上当；适度游戏益脑，沉迷游戏伤身；合理安排时间，享受健康生活。\n"
    //     ]
    // }
}