
export let TestEmail = {
    "0": {
        "text": "用户隐私政策条款\n",
        "style": {
            "align": "CENTER",
            "bold": true
        }
    },
    "1": {
        "text": [
            "更新日期：2023-11-03\n生效日期：2023-11-03\n"
        ],
        "style": {
            "bold": true
        }
    },
    "2": {
        "text": [
            "\t\t\t\t游戏名称:《app_name》",
            "\t\t\t\t开发者名称:company（以下称“我们”或“本公司”）注重保护用户个人隐私。本《用户隐私政策条款》（以下简称本条款解释了用户（“您”）个人信息（以下称“信息”）收集和使用的有关情况，本条款与您使用本 公司提供的所有服务（包括但不限于游戏服务）息息相关，您应仔细阅读并确认您已充分理解且同意本条款内容。如果您不同意本条款的任何内容，您应立即停止使用本公司的服务。当您使用或继续使用本公司提供的任一服务时，即表示您已同意我们按照本条款来合法收集、使用和保护您的个人信息。本条款包含如下内容：\n",
            "\t\t\t\t地址：address",
            "\t\t\t\t小游戏运行所需权限列表及用途",

        ]
    },
    "3": {
        "text": [
            "\t\t《app_name》为单机游戏，暂时不会需要任何您的个人信息，如果后期需要个人信息，将会更新此隐私政策。\n",
            "\t\t一、我们收集您的如下信息\n",
            "\t\t二、我们按照以下原则存储您的信息\n",
            "\t\t三、我们通过以下方式使用您的信息\n",
            "\t\t四、我们在以下方面共享您的信息\n",
            "\t\t五、您可以通过如下方式管理您的信息\n",
            "\t\t六、我们通过如下措施管理保护您的信息\n",
            "\t\t七、我们对未成年人个人信息的保护\n",
            "\t\t八、修订与通知\n",
            "\t\t九、联系我们\n"
        ]
    },
    "4": {
        "text": "一、我们收集您的如下信息",
        "style": {
            "bold": true
        }
    },
    "5": {
        "text": [
            "\t\t1.当您注册或使用本公司的游戏服务时，我们会收集您的网络身份标识信息及个人常用设备信息，用于标记您为本公司的游戏用户。如果您使用微信或QQ关联登录我们的游戏，我们会收集您微信或QQ的唯一标识、头像、昵称，用于保存您的登录信息，以便您在不同设备登录。\n",
            "\t\t2.为了更好地向您提供游戏服务，改善游戏体验，我们可对您QQ帐号、微信账号或游戏账号中的昵称、头像以及在本公司运营的游戏中的相关操作信息、游戏信息等信息（以下称“该等信息”。该等信息具体包括但不限于您的登录状态、对战信息/状态、成就信息等）进行收集和使用，并可向您本人或其他用户或好友展示该等信息。我们可能会视游戏产品具体情况为您提供相关权限，以便您可以对是否展示前述相关信息进行相应设置。\n",
            "\t\t3.为满足相关法律法规政策及相关主管部门的要求，游戏用户需进行实名认证以继续使用和享受我们的游戏。我们会在获得您同意或您主动提供的情况下收集您的实名身份信息（包括姓名、身份证号、照片等信息），该信息属于敏感信息，拒绝提供实名身份信息可能会导致您无法登陆本公司游戏或在使用本公司游戏过程中受到相应限制。除此之外，您可以根据自身需求选择填写性别、地区等信息。\n",
            "\t\t4.为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备信息（包括设备ID、设备名称、设备类型和版本、系统版本、IP地址、MAC地址、应用ID、网络类型等）。\n",
            "\t\t5.当您使用我们的游戏服务时，我们会收集您的游戏日志信息，例如登录日志、物品日志、游戏对局信息、交友记录等，以便您能够在客户端查看您的游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升您的游戏体验，我们可能把前述信息同步至该游戏后续版本或您正在使用的我们提供的其他产品中。\n",
            "\t\t6.当您使用游戏产品的消费功能时，我们会收集您的充值记录、消费记录等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。充值记录、消费记录属于敏感信息，收集上述信息为实现游戏产品的消费功能所必须，否则将无法完成交易。\n",
            "\t\t7.为保障您的游戏账号安全，营造公平、健康及安全的游戏环境，我们会收集您的游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊等）。\n",
            "\t\t8.当您在游戏中通过文字、图片、语音、视频及其他方式与其他玩家进行互动，我们可能会收集并保存您发送的上述信息内容用于过滤色情、暴力、政治、辱骂、恶意广告等不当内容，以此净化游戏环境，维护健康的上网环境。\n",
            "\t\t9.如您希望与附近的游戏玩家互动，在您授权同意后，我们会收集您的地理位置信息，用于寻找附近的游戏玩家，以便您与附近的玩家匹配、组队等。地理位置信息属于敏感信息，拒绝提供该信息只会导致您无法实现与附近的游戏玩家互动，但不影响您正常使用游戏的其他功能，您也可以随时取消您的地理位置信息授权。\n",
            "\t\t10.根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息而无需征求您的授权同意：\n",
            "\t\t\t\tⅠ.与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；\n",
            "\t\t\t\tⅡ.与犯罪侦查、起诉、审判和判决执行等直接相关的；\n",
            "\t\t\t\tⅢ.出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；\n",
            "\t\t\t\tⅣ.所收集的个人信息是您自行向社会公众公开的；\n",
            "\t\t\t\tⅤ.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；\n",
            "\t\t\t\tⅥ.根据您要求签订和履行合同所必需的；\n",
            "\t\t\t\tⅦ.用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；\n",
            "\t\t\t\tⅧ.为开展合法的新闻报道所必需的；\n",
            "\t\t\t\tⅨ.出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；\n",
            "\t\t\t\tⅩ.法律法规规定的其他情形。\n",
            "11.请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。\n"
        ]
    },
    "6": {
        "text": "二、我们按照以下原则存储您的信息",
        "style": {
            "bold": true
        }
    },
    "7": {
        "text": [
            "\t\t1.我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志。一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。\n",
            "\t\t2.我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。\n",
            "\t\t3.当我们的产品或服务发生停止运营的情况时，我们将根据相关法律法规规定进行公告通知，并依法保障您的合法权益。\n"
        ]
    },
    "8": {
        "text": "三、我们通过以下方式使用您的信息",
        "style": {
            "bold": true
        }
    },
    "9": {
        "text": [
            "\t\t1.您登录游戏时，我们使用您提供的账号等网络身份标识信息，用于识别和（或）确认您的身份。\n",
            "\t\t2.我们会根据您的信息向您提供、维护、改进我们的服务，使我们的服务更能符合您的要求，让您在使用我们的服务时获得更好地体验。\n",
            "\t\t3.我们会对您的服务使用情况信息进行统计，以展示我们产品或服务的整体使用趋势。但这些统计信息中不包含您的任何身份识别信息。\n",
            "\t\t4.我们将会在本条款所涵盖的用途内使用收集的信息。如我们使用您的个人信息超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的明示同意。\n"
        ]
    },
    "10": {
        "text": "四、我们在以下方面共享您的信息",
        "style": {
            "bold": true
        }
    },
    "11": {
        "text": [
            "\t\t1.您分享的信息\n",
            "\t\t\t\t我们的很多服务都允许您与其他人分享您的相关信息，并且您可以控制分享的方式。您可以按照我们服务中的设置或我们提供的指引删除您公开分享的信息。但请注意，这些分享信息可能由其他用户或不受我们控制的第三方独立地保存。\n",
            "\t\t2.您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。除以下情形外，我们不会将您的信息披露给第三方：\n",
            "\t\t\t\tⅠ.我们会为了协助解决争议而向投诉人 / 被投诉人披露您的信息，以便双方处理可能产生的权利纠纷。\n",
            "\t\t\t\tⅡ.您出现违反中国有关法律、法规规定或者违反您与本公司签署的协议（包括在线签署的电子协议）时需要向第三方披露的情形。\n",
            "\t\t\t\tⅢ.根据法律法规的规定或行政或司法机构的要求，对外披露您的信息。\n",
            "\t\t\t\tⅣ.经过您的授权或同意的其他需要共享您信息的情况。\n"
        ]
    },
    "12": {
        "text": "五、您可以通过如下方式管理您的信息",
        "style": {
            "bold": true
        }
    },
    "13": {
        "text": "\t\t在您使用我们的游戏服务期间，我们可能会视游戏产品具体情况为您提供相应的操作设置，以便您可以查询、删除、更新或撤回您的相关个人信息，您可参考相应游戏产品的具体指引进行操作。\n"
    },
    "14": {
        "text": "六、我们通过如下措施管理保护您的信息",
        "style": {
            "bold": true
        }
    },
    "15": {
        "text": [
            "\t\t\t\t本公司严格保护您的信息安全。我们将提供如下方法管理保护您的信息：\n",
            "\t\t1.我们使用各种管理制度、安全制度等来管理规范您信息的存储和使用。\n",
            "\t\t2.我们采用符合标准的安全防护措施，信息加密等技术措施，来防止您的信息遭到未经授权的访问、使用、修改，避免您信息的损坏或丢失。\n",
            "\t\t3.请您妥善保护自己的信息，仅在必要的情形下向他人提供。如您发现自己的信息泄密，尤其是你的账户及密码发生泄露，请您立即联络我们的客服，以便我们采取相应措施。\n"
        ]
    },
    "16": {
        "text": "七、我们对未成年人个人信息的保护",
        "style": {
            "bold": true
        }
    },
    "17": {
        "text": [
            "\t\t我们非常重视对未成年人个人信息的保护。如果您是未成年人，在使用我们的游戏前，您应取得您父母或法定监护人的同意。我们将根据国家相关法律法规的规定保护您的信息。\n",
            "\t\t我们只会在法律允许、父母或法定监护人明确同意或保护未成年人所必要的情况下使用或公开披露此信息。\n",
            "\t\t我们会积极按照国家防沉迷政策要求，通过启动防沉迷系统保护未成年人的合法权益。我们会通过实名身份等信息校验判断相关账号的实名信息是否为未成年人，进而决定是否将此账号纳入到防沉迷体系中。另外，我们会收集您的登录时间、游戏时长等信息，通过从系统层面自动干预和限制未成年人游戏时间、启用强制下线功能等方式，引导未成年人合理游戏，并在疑似未成年人消费后尝试联系其监护人进行提醒、确认与处理，帮助未成年人健康上网。\n"
        ]
    },
    "18": {
        "text": "八、修订与通知",
        "style": {
            "bold": true
        }
    },
    "19": {
        "text": "\t\t为给你提供更好的服务，服务内容将不时变化，本条款也将随之调整。我们在调整后的条款生效前会在相关服务中发出更新公告并提醒您相关内容的更新，也请您访问相关官方网站以便及时了解最新的隐私条款。"
    },
    "20": {
        "text": "九、联系我们",
        "style": {
            "bold": true
        }
    },
    "21": {
        "text": "\t\t如果您对本隐私政策有任何疑问，请通过email与我们联系。。"
    }
}